# GetWallStyle

## Description
Gets the name of the Wall Style for theWall.

```pascal
FUNCTION GetWallStyle(theWall : HANDLE): STRING;
```

```python
def vs.GetWallStyle(theWall):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theWall|HANDLE|The wall.|

## Remarks
Gets the name of the Wall Style for theWall

## See Also
VS Functions:
SetWallStyle

## Version
Availability: from VectorWorks12.0

## Category
* Objects - Walls